homework/app/views/events/_form.html.erb

    <%= f.label :venue_id %><br />
    <%= f.collection_select :venue_id, Venue.order('name ASC').all, :id, :name %>
---
SELECT "venues".* FROM "venues" ORDER BY name ASC